Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/appointments_by_the_president.html.txt.tmx
Source language: en
Languages: ga

source: The President of Ireland has an important role in appointing people to various offices of State
ga: Tá ról tábhachtach ag an Uachtarán i gceapadh daoine chun oifigí Stáit éagsúla

source: For example, the President appoints the Taoiseach (Prime Minister), who has been nominated by Dáil Éireann
ga: Mar shampla, ceapann an tUachtarán an Taoiseach, atá ainmnithe ag Dáil Éireann

source: The Taoiseach then nominates the other members of parliament that will make up the Government
ga: Ainmníonn an Taoiseach ansin comhaltaí eile an Rialtais

source: They are approved by the Dáil and then appointed by the President
ga: Déanann an Dáil iad a cheadú agus ansin ceapann an tUachtarán iad

source: The President accepts the resignation or terminates the appointment of a Government member after they have been advised to do so by the Taoiseach
ga: Glacann an tUachtarán le fógra scoir nó scoireann sé/sí féin ceapachán comhalta den Rialtas tar éis don Taoiseach comhairle a chur air/uirthi é sin a dhéanamh

source: The President appoints the Attorney General (legal adviser to the Government), who is nominated by the Taoiseach
ga: Ceapann an tUachtarán an tArdAighne, atá ainmnithe ag an Taoiseach

source: The President also appoints the Comptroller and Auditor General, who is nominated by Dáil Eireann
ga: Ceapann an tUachtarán an tArd Reachtaire Cuntas agus Ciste, atá ainmnithe ag Dáil Éireann

source: The President appoints the judges nominated by the Government to the various courts throughout the country
ga: Ceapann an tUachtarán na Breithimh atá ainmnithe ag an Rialtas lena cúirteanna ar fúd na tíre
